---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.BoundaryConditions
source: html/8c24b5f4-c86e-9d2f-07bb-fdff4161246c.htm
---
# BoundaryConditions Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.